W9TIM/ATEM_tally_light_Relay_with_ESP8266/ATEM_tally_light/ATEM_tally_light.cpp
/*
    
    
    ON MAC USE ESP8266 BOARD VERSION 3.02               (DO NOT UPDATE!) (TS 3-27-24)
            Newer board driver versions do not complie on MacOS due to Python3 version incompatability

    REMOVED ALL COMPILE MACRO REFERENCES / USE OF TALLY_TEST_SERVER CODE (TS 3-27-24)

    ADDED   DEFAULT TALLY NUMBER IF NOT DEFINED IN RANGE                 (TS 3-28-24)

    ADDED   Live Source Mode - defined by list of ATEM sources that together with the current streaming status devine "On Air Live" 
            this is used to control the relay shield in order to provide an "On Air" light that is only active when one of the identified 
            sources is in Program and the ATEM is streaming. This functionality allows for some sources to be active without activating the 
            relay (Light) therefor allowing for a media presented as a "starting soon screen" or pre-recorded media source. 
            This functionality provides a simple and easily understood single source indicator for those presenting that they are 
            currently the focus of the stream (Live On Air). 
            
            The Setup Web page now has a Live Sources text entry box. Here all of the sources that should be considered 'Live' as described
            above can be entered as a single line of text. For example if any of the sources 1, 2 or 5 actie on the Program bus along with
            streaming On Air to activate the Relay enter "1,2,5" in the Live Sources Text field. This is the pre-defined example.
            
            The Live Sources field will support 30 characters and any sources 1-40 can be included.                             (TS 3-28-24)
    
    ADDED   Added mode test to 'Connecting to WiFi section (about 348-364) to avoid a false condition turning on the on air sign during
            boot up and connection initialization. This can be an issue for devices that are powered all the time and the ATEM Switcher
            is not. See about line 362 below: if (settings.tallyModeLED1 == MODE_ON_AIR_LIVE) setBothLEDs(LED_OFF); else setBothLEDs(LED_WHITE);
    
    NOTES   This modified version can be compiled and used with the LED's as originally desribed in the DIY Guide
            The Red & Blue connections for LED1 are reversed in order to also support the Relay Shield if used. 


    This program makes an ESP8266 into a wireless tally light system for ATEM switchers,
    by using Kasper Skårhøj's (<https://skaarhoj.com>) ATEM client libraries for Arduino.

    This program is free software: you can redistribute it and/or modify
    it under the terms of the GNU General Public License as published by
    the Free Software Foundation, either version 3 of the License, or
    (at your option) any later version.

    This program is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
    GNU General Public License for more details.

    You should have received a copy of the GNU General Public License
    along with this program.  If not, see <https://www.gnu.org/licenses/>.
    Portions Copyright (C) 2023 Aron N. Het Lam, aronhetlam@gmail.com

*/

#include "ATEM_tally_light.hpp"

#ifndef VERSION
#define VERSION "dev"
#endif

// #define DEBUG_LED_STRIP
#define FASTLED_ALLOW_INTERRUPTS 0

#ifndef CHIP_FAMILY
#define CHIP_FAMILY "Unknown"
#endif

#ifndef VERSION
#define VERSION "Unknown"
#endif

#define DISPLAY_NAME "Tally & On Air Light"

//Include libraries:
#if ESP32
//#include <esp_wifi.h>
#include <WebServer.h>
#include <WiFi.h>
#else
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#endif

#include <EEPROM.h>
#include <ATEMmin.h>
#include <TallyServer.h>
#include <FastLED.h>

#if ESP32
//Define LED1 color pins
#ifndef PIN_RED1
#define PIN_RED1 32  //Set to D1 pin for Relay Shield
#endif
#ifndef PIN_GREEN1
#define PIN_GREEN1 33
#endif
#ifndef PIN_BLUE1
#define PIN_BLUE1 25
#endif

//Define LED2 color pins
#ifndef PIN_RED2
#define PIN_RED2 26  //Set to D1 pin for Relay Shield
#endif
#ifndef PIN_GREEN2
#define PIN_GREEN2 27
#endif
#ifndef PIN_BLUE2
#define PIN_BLUE2 14
#endif

#else  // ESP8266
//Define LED1 color pins
#ifndef PIN_RED1
#define PIN_RED1 5  // Set to D1 pin for Relay Shield (Red & Blue pins are swapped from original DIY guide instructions)
#endif
#ifndef PIN_GREEN1
#define PIN_GREEN1 4  // D2
#endif
#ifndef PIN_BLUE1
#define PIN_BLUE1 16  // Set to D0 pin for Relay Shield
#endif

//Define LED2 color pins
#ifndef PIN_RED2
#define PIN_RED2 2  // D4 - This is also the D1 Wemos on-board LED
#endif
#ifndef PIN_GREEN2
#define PIN_GREEN2 14  // D5
#endif
#ifndef PIN_BLUE2
#define PIN_BLUE2 12  // D6
#endif
#endif

//Define LED colors
#define LED_OFF 0
#define LED_RED 1
#define LED_GREEN 2
#define LED_BLUE 3
#define LED_YELLOW 4
#define LED_PINK 5
#define LED_WHITE 6
#define LED_ORANGE 7

//Map "old" LED colors to CRGB colors
CRGB color_led[8] = { CRGB::Black, CRGB::Red, CRGB::Lime, CRGB::Blue, CRGB::Yellow, CRGB::Fuchsia, CRGB::White, CRGB::Orange };

//Define states
#define STATE_STARTING 0
#define STATE_CONNECTING_TO_WIFI 1
#define STATE_CONNECTING_TO_SWITCHER 2
#define STATE_RUNNING 3

//Define modes of operation
#define MODE_NORMAL 1
#define MODE_PREVIEW_STAY_ON 2
#define MODE_PROGRAM_ONLY 3
#define MODE_ON_AIR 4
#define MODE_ON_AIR_LIVE 5  //ADDED to test both Streaming & Specific Tally Conditions (Sources 1,2,5) for Live Activity
#define MODE_OFF 6          //ADDED to disable LED #2 when not being used at all. 

#define TALLY_FLAG_OFF 0
#define TALLY_FLAG_PROGRAM 1
#define TALLY_FLAG_PREVIEW 2

//Define Neopixel status-LED options
#define NEOPIXEL_STATUS_FIRST 1
#define NEOPIXEL_STATUS_LAST 2
#define NEOPIXEL_STATUS_NONE 3

//FastLED
#ifndef TALLY_DATA_PIN
#if ESP32
#define TALLY_DATA_PIN 12
#elif ARDUINO_ESP8266_NODEMCU
#define TALLY_DATA_PIN 7
#else
#define TALLY_DATA_PIN 13  // D7
#endif
#endif
int numTallyLEDs;
int numStatusLEDs;
CRGB *leds;
CRGB *tallyLEDs;
CRGB *statusLED;
bool neopixelsUpdated = false;

//Initialize global variables
#if ESP32
WebServer server(80);
#else
ESP8266WebServer server(80);
#endif

ATEMmin atemSwitcher;

TallyServer tallyServer;

ImprovWiFi improv(&Serial);

uint8_t state = STATE_STARTING;

//Define struct for holding tally settings (mostly to simplify EEPROM read and write, in order to persist settings)
struct Settings {
  char tallyName[32] = "";
  char liveSources[32] = "";    //ADDED to test both Streaming & Specific Tally Conditions (Default Sources 1,2,5) for Live Activity
  uint8_t tallyNo;
  uint8_t tallyModeLED1;
  uint8_t tallyModeLED2;
  bool staticIP;
  IPAddress tallyIP;
  IPAddress tallySubnetMask;
  IPAddress tallyGateway;
  IPAddress switcherIP;
  uint16_t neopixelsAmount;
  uint8_t neopixelStatusLEDOption;
  uint8_t neopixelBrightness;
  uint8_t ledBrightness;
};

Settings settings;

bool firstRun = true;

int bytesAvailable = false;
uint8_t readByte;

//Commented out for users without batteries
// long secLoop = 0;
// int lowLedCount = 0;
// bool lowLedOn = false;
// double uBatt = 0;
// char buffer[3];

void onImprovWiFiErrorCb(ImprovTypes::Error err) {
}

