W9TIM/ATEM_tally_light_Relay_with_ESP8266/ATEM_tally_light/ATEM_tally_light.cpp
void onImprovWiFiConnectedCb(const char *ssid, const char *password) {
}

//Perform initial setup on power on
void setup() {
  //Init pins for LED
  pinMode(PIN_RED1, OUTPUT);
  pinMode(PIN_GREEN1, OUTPUT);
  pinMode(PIN_BLUE1, OUTPUT);

  pinMode(PIN_RED2, OUTPUT);
  pinMode(PIN_GREEN2, OUTPUT);
  pinMode(PIN_BLUE2, OUTPUT);

  setBothLEDs(LED_OFF);
  //Setup current-measuring pin - Commented out for users without batteries
  // pinMode(A0, INPUT);

  //Start Serial
  Serial.begin(115200);
  Serial.println("\n\n########################");
  Serial.println("Serial started \n");

  //Read settings from EEPROM. WIFI settings are stored separately by the ESP
  EEPROM.begin(sizeof(settings));  //Needed on ESP8266 module, as EEPROM lib works a bit differently than on a regular Arduino
  EEPROM.get(0, settings);

  //Initialize LED strip
  if (0 < settings.neopixelsAmount && settings.neopixelsAmount <= 1000) {
    leds = new CRGB[settings.neopixelsAmount];
    FastLED.addLeds<NEOPIXEL, TALLY_DATA_PIN>(leds, settings.neopixelsAmount);

    if (settings.neopixelStatusLEDOption != NEOPIXEL_STATUS_NONE) {
      numStatusLEDs = 1;
      numTallyLEDs = settings.neopixelsAmount - numStatusLEDs;
      if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_FIRST) {
        statusLED = leds;
        tallyLEDs = leds + numStatusLEDs;
      } else {  // if last or or other value
        statusLED = leds + numTallyLEDs;
        tallyLEDs = leds;
      }
    } else {
      numTallyLEDs = settings.neopixelsAmount;
      numStatusLEDs = 0;
      tallyLEDs = leds;
    }
  } else {
    settings.neopixelsAmount = 0;
    numTallyLEDs = 0;
    numStatusLEDs = 0;
  }

  FastLED.setBrightness(settings.neopixelBrightness);
  setSTRIP(LED_OFF);
  setStatusLED(LED_OFF);
  FastLED.show();

  if (settings.staticIP && settings.tallyIP != IPADDR_NONE) {
    WiFi.config(settings.tallyIP, settings.tallyGateway, settings.tallySubnetMask);
  } else {
    settings.staticIP = false;
  }

  //Put WiFi into station mode and make it connect to saved network
  WiFi.mode(WIFI_STA);
#if ESP32
  WiFi.setHostname(settings.tallyName);
#else
  WiFi.hostname(settings.tallyName);
#endif
  WiFi.setAutoReconnect(true);
  WiFi.begin();

  Serial.println("------------------------");
  Serial.println("Connecting to WiFi...");
  Serial.println("Network name (SSID): " + getSSID());

  // Initialize and begin HTTP server for handeling the web interface
  server.on("/", handleRoot);
  server.on("/save", handleSave);
  server.onNotFound(handleNotFound);
  server.begin();

  tallyServer.begin();

  improv.setDeviceInfo(CHIP_FAMILY, DISPLAY_NAME, VERSION, "Tally Light", "");
  improv.onImprovError(onImprovWiFiErrorCb);
  improv.onImprovConnected(onImprovWiFiConnectedCb);

  //Wait for result from first attempt to connect - This makes sure it only activates the softAP if it was unable to connect,
  //and not just because it hasn't had the time to do so yet. It's blocking, so don't use it inside loop()
  unsigned long start = millis();
  while ((!WiFi.status() || WiFi.status() >= WL_DISCONNECTED) && (millis() - start) < 10000LU) {
    bytesAvailable = Serial.available();
    if (bytesAvailable > 0) {
      readByte = Serial.read();
      improv.handleByte(readByte);
    }
  }

  //Set state to connecting before entering loop
  changeState(STATE_CONNECTING_TO_WIFI);
}

void loop() {
  bytesAvailable = Serial.available();
  if (bytesAvailable > 0) {
    readByte = Serial.read();
    improv.handleByte(readByte);
  }
 
  switch (state) {
    case STATE_CONNECTING_TO_WIFI:
      if (WiFi.status() == WL_CONNECTED) {
        WiFi.mode(WIFI_STA);  // Disable softAP if connection is successful
        Serial.println("------------------------");
        Serial.println("Connected to WiFi:   " + getSSID());
        Serial.println("IP:                  " + WiFi.localIP().toString());
        Serial.println("Subnet Mask:         " + WiFi.subnetMask().toString());
        Serial.println("Gateway IP:          " + WiFi.gatewayIP().toString());
        changeState(STATE_CONNECTING_TO_SWITCHER);
      } else if (firstRun) {
        firstRun = false;
        Serial.println("Unable to connect. Serving \"Tally & On Air Light Setup\" WiFi for configuration, while still trying to connect...");
        WiFi.softAP((String)DISPLAY_NAME + " Setup");
        WiFi.mode(WIFI_AP_STA);  // Enable softAP to access web interface in case of no WiFi
        if (settings.tallyModeLED1 == MODE_ON_AIR_LIVE) setBothLEDs(LED_OFF); else setBothLEDs(LED_WHITE);
        //setBothLEDs(LED_WHITE);  // The statement above avoides a false indicator on the On Air Sign Relay while waiting to connect to the switcher. 
        setStatusLED(LED_WHITE);
      }
      break;

    case STATE_CONNECTING_TO_SWITCHER:
      // Initialize a connection to the switcher:
      if (firstRun) {
        atemSwitcher.begin(settings.switcherIP);
        //atemSwitcher.serialOutput(0xff); //Makes Atem library print debug info
        Serial.println("------------------------");
        Serial.println("Connecting to switcher...");
        Serial.println((String) "Switcher IP:         " + settings.switcherIP[0] + "." + settings.switcherIP[1] + "." + settings.switcherIP[2] + "." + settings.switcherIP[3]);
        firstRun = false;
      } 
      atemSwitcher.runLoop();
      if (atemSwitcher.isConnected()) {
        changeState(STATE_RUNNING);
        Serial.println("Connected to switcher");
      }
      break;
    case STATE_RUNNING:
      //Handle data exchange and connection to swithcher
      atemSwitcher.runLoop();

      int tallySources = atemSwitcher.getTallyByIndexSources();
      tallyServer.setTallySources(tallySources);
      for (int i = 0; i < tallySources; i++) {
        tallyServer.setTallyFlag(i, atemSwitcher.getTallyByIndexTallyFlags(i));
      }

      //Handle Tally Server
      tallyServer.runLoop();

      //Set LED and Neopixel colors accordingly
      int color = getLedColor(settings.tallyModeLED1, settings.tallyNo);
      setLED1(color);
      setSTRIP(color);


