W9TIM/ATEM_tally_light_Relay_with_ESP8266/ATEM_tally_light/ATEM_tally_light.cpp
      color = getLedColor(settings.tallyModeLED2, settings.tallyNo);
      setLED2(color);

    //Switch state if ATEM connection is lost...
      if (!atemSwitcher.isConnected()) {  // will return false if the connection was lost
        Serial.println("------------------------");
        Serial.println("Connection to Switcher lost...");
        changeState(STATE_CONNECTING_TO_SWITCHER);

        //Reset tally server's tally flags, so clients turn off their lights.
        tallyServer.resetTallyFlags();
      }

      //Commented out for userst without batteries - Also timer is not done properly
      // batteryLoop();
      break;
  }

  //Switch state if WiFi connection is lost...
  if (WiFi.status() != WL_CONNECTED && state != STATE_CONNECTING_TO_WIFI) {
    Serial.println("------------------------");
    Serial.println("WiFi connection lost...");
    changeState(STATE_CONNECTING_TO_WIFI);

    //Force atem library to reset connection, in order for status to read correctly on website.
    atemSwitcher.begin(settings.switcherIP);
    atemSwitcher.connect();

    //Reset tally server's tally flags, They won't get the message, but it'll be reset for when the connection is back.
    tallyServer.resetTallyFlags();
  }

  //Show strip only on updates
  if (neopixelsUpdated) {
    FastLED.show();
#ifdef DEBUG_LED_STRIP
    Serial.println("Updated LEDs");
#endif
    neopixelsUpdated = false;
  }
  //Handle web interface
  server.handleClient();
}

//Handle the change of states in the program
void changeState(uint8_t stateToChangeTo) {
  firstRun = true;
  switch (stateToChangeTo) {
    case STATE_CONNECTING_TO_WIFI:
      state = STATE_CONNECTING_TO_WIFI;
      setBothLEDs(LED_BLUE);
      setStatusLED(LED_BLUE);
      setSTRIP(LED_OFF);
      break;
    case STATE_CONNECTING_TO_SWITCHER:
      state = STATE_CONNECTING_TO_SWITCHER;
      if (settings.tallyModeLED1 == MODE_ON_AIR_LIVE) setBothLEDs(LED_OFF); else setBothLEDs(LED_PINK);
      //setBothLEDs(LED_PINK); // The statement above avoides a false indicator on the On Air Sign Relay while waiting to connect to the switcher. 
      setStatusLED(LED_PINK);
      setSTRIP(LED_OFF);
      break;
    case STATE_RUNNING:
      state = STATE_RUNNING;
      setBothLEDs(LED_GREEN);
      setStatusLED(LED_ORANGE);
      break;
  }
}

//Set the color of both LEDs
void setBothLEDs(uint8_t color) {
  setLED(color, PIN_RED1, PIN_GREEN1, PIN_BLUE1);
  setLED(color, PIN_RED2, PIN_GREEN2, PIN_BLUE2);
}

//Set the color of the 1st LED
void setLED1(uint8_t color) {
  setLED(color, PIN_RED1, PIN_GREEN1, PIN_BLUE1);
}

//Set the color of the 2nd LED
void setLED2(uint8_t color) {
  setLED(color, PIN_RED2, PIN_GREEN2, PIN_BLUE2);
}

//Set the color of a LED using the given pins
void setLED(uint8_t color, int pinRed, int pinGreen, int pinBlue) {
#if ESP32
  switch (color) {
    case LED_OFF:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 0);
      break;
    case LED_RED:
      digitalWrite(pinRed, 1);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 0);
      break;
    case LED_GREEN:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 1);
      digitalWrite(pinBlue, 0);
      break;
    case LED_BLUE:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 1);
      break;
    case LED_YELLOW:
      digitalWrite(pinRed, 1);
      digitalWrite(pinGreen, 1);
      digitalWrite(pinBlue, 0);
      break;
    case LED_PINK:
      digitalWrite(pinRed, 1);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 1);
      break;
    case LED_WHITE:
      digitalWrite(pinRed, 1);
      digitalWrite(pinGreen, 1);
      digitalWrite(pinBlue, 1);
      break;
  }
#else
  uint8_t ledBrightness = settings.ledBrightness;
  void (*writeFunc)(uint8_t, uint8_t);
  if (ledBrightness >= 0xff) {
    writeFunc = &digitalWrite;
    ledBrightness = 1;
  } else {
    writeFunc = &analogWriteWrapper;
  }

  switch (color) {
    case LED_OFF:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 0);
      break;
    case LED_RED:
      writeFunc(pinRed, ledBrightness);
      digitalWrite(pinGreen, 0);
      digitalWrite(pinBlue, 0);
      break;
    case LED_GREEN:
      digitalWrite(pinRed, 0);
      writeFunc(pinGreen, ledBrightness);
      digitalWrite(pinBlue, 0);
      break;
    case LED_BLUE:
      digitalWrite(pinRed, 0);
      digitalWrite(pinGreen, 0);
      writeFunc(pinBlue, ledBrightness);
      break;
    case LED_YELLOW:
      writeFunc(pinRed, ledBrightness);
      writeFunc(pinGreen, ledBrightness);
      digitalWrite(pinBlue, 0);
      break;
    case LED_PINK:
      writeFunc(pinRed, ledBrightness);
      digitalWrite(pinGreen, 0);
      writeFunc(pinBlue, ledBrightness);
      break;
    case LED_WHITE:
      writeFunc(pinRed, ledBrightness);
      writeFunc(pinGreen, ledBrightness);
      writeFunc(pinBlue, ledBrightness);
      break;
  }
#endif
}

void analogWriteWrapper(uint8_t pin, uint8_t value) {
  analogWrite(pin, value);
}

//Set the color of the LED strip, except for the status LED
void setSTRIP(uint8_t color) {
  if (numTallyLEDs > 0 && tallyLEDs[0] != color_led[color]) {
    for (int i = 0; i < numTallyLEDs; i++) {
      tallyLEDs[i] = color_led[color];
    }
    neopixelsUpdated = true;
#ifdef DEBUG_LED_STRIP
    Serial.println("Tally:  ");
    printLeds();
#endif
  }
}

//Set the single status LED (last LED)
void setStatusLED(uint8_t color) {
  if (numStatusLEDs > 0 && statusLED[0] != color_led[color]) {
    for (int i = 0; i < numStatusLEDs; i++) {
      statusLED[i] = color_led[color];
      if (color == LED_ORANGE) {
        statusLED[i].fadeToBlackBy(230);
      } else {
        statusLED[i].fadeToBlackBy(0);
      }
    }
    neopixelsUpdated = true;
#ifdef DEBUG_LED_STRIP
    Serial.println("Status: ");
    printLeds();
#endif
  }
}

#ifdef DEBUG_LED_STRIP
void printLeds() {
  for (int i = 0; i < settings.neopixelsAmount; i++) {
    Serial.print(i);
    Serial.print(", RGB: ");
    Serial.print(leds[i].r);
    Serial.print(", ");
    Serial.print(leds[i].g);
    Serial.print(", ");
    Serial.println(leds[i].b);
  }
  Serial.println();
}
#endif

int getTallyState(uint16_t tallyNo) {
  if (tallyNo >= atemSwitcher.getTallyByIndexSources()) {  //out of range
    return TALLY_FLAG_OFF;
  }
  uint8_t tallyFlag = atemSwitcher.getTallyByIndexTallyFlags(tallyNo);
  if (tallyFlag & TALLY_FLAG_PROGRAM) {
    return TALLY_FLAG_PROGRAM;
  } else if (tallyFlag & TALLY_FLAG_PREVIEW) {
    return TALLY_FLAG_PREVIEW;
  } else {
    return TALLY_FLAG_OFF;
  }
}

