W9TIM/ATEM_tally_light_Relay_with_ESP8266/ATEM_tally_light/ATEM_tally_light.cpp
int getLedColor(int tallyMode, int tallyNo) {

  String camSources = String(settings.liveSources);

  if (tallyMode == MODE_OFF) {
    return LED_OFF;
  }
  if (tallyMode == MODE_ON_AIR) { //Streaming Indicator
    if (atemSwitcher.getStreamStreaming()) {
      return LED_RED;
    }
    return LED_OFF;
  }  // end of MODE_ON_AIR

  if (tallyMode == MODE_ON_AIR_LIVE) {
    //TEST LIVE SOURCES FOR PROGRAM STATE - Streaming AND using any of a list of sources

    if (atemSwitcher.getStreamStreaming()) {
       for (uint8_t i = 0; i < 40; i++) {
        // Test valid and available sources
        if (i >= atemSwitcher.getTallyByIndexSources()) {  //out of range
          i = 41;                                           // all valid sources checked exit loop
        } // end valid source check

        // test sources for program state
        if ((TALLY_FLAG_PROGRAM == getTallyState(i)) && (i < 41)) {
          // test if program source is source in Live List
          if (camSources.indexOf(String(i+1))>-1) { // Is this a listed 'Live' source?
              return LED_RED; // Turn on light (relay) and exit function call
          }  // End Live Source check
        } // End Program Flag Check
      } // end_for loop through available sources
       return LED_OFF; // turn off light (relay) and exit function call, no valid live source found 
    } else { // not streaming
      return LED_OFF; // turn off light (relay) and exit function call, not streaming
    } //endif streaming
    
  } // end of MODE_ON_AIR_LIVE

  int tallyState = getTallyState(tallyNo);

  if (tallyState == TALLY_FLAG_PROGRAM) {  //if tally live
    return LED_RED;
  } else if ((tallyState == TALLY_FLAG_PREVIEW       //if tally preview
              || tallyMode == MODE_PREVIEW_STAY_ON)  //or preview stay on
             && tallyMode != MODE_PROGRAM_ONLY) {    //and not program only
    return LED_GREEN;
  } else {  //if tally is neither
    return LED_OFF;
  }  // End of Tally Light mode
}

//Serve setup web page to client, by sending HTML with the correct variables
void handleRoot() {
  String html = "<!DOCTYPE html><html><head><meta charset=\"ASCII\"><meta name=\"viewport\"content=\"width=device-width,initial-scale=1.0\"><title>Tally & On Air Light Setup</title></head><script>function switchIpField(e){console.log(\"switch\");console.log(e);var target=e.srcElement||e.target;var maxLength=parseInt(target.attributes[\"maxlength\"].value,10);var myLength=target.value.length;if(myLength>=maxLength){var next=target.nextElementSibling;if(next!=null){if(next.className.includes(\"IP\")){next.focus();}}}else if(myLength==0){var previous=target.previousElementSibling;if(previous!=null){if(previous.className.includes(\"IP\")){previous.focus();}}}}function ipFieldFocus(e){console.log(\"focus\");console.log(e);var target=e.srcElement||e.target;target.select();}function load(){var containers=document.getElementsByClassName(\"IP\");for(var i=0;i<containers.length;i++){var container=containers[i];container.oninput=switchIpField;container.onfocus=ipFieldFocus;}containers=document.getElementsByClassName(\"tIP\");for(var i=0;i<containers.length;i++){var container=containers[i];container.oninput=switchIpField;container.onfocus=ipFieldFocus;}toggleStaticIPFields();}function toggleStaticIPFields(){var enabled=document.getElementById(\"staticIP\").checked;document.getElementById(\"staticIPHidden\").disabled=enabled;var staticIpFields=document.getElementsByClassName('tIP');for(var i=0;i<staticIpFields.length;i++){staticIpFields[i].disabled=!enabled;}}</script><style>a{color:#0F79E0}</style><body style=\"font-family:Verdana;white-space:nowrap;\"onload=\"load()\"><table cellpadding=\"2\"style=\"width:100%\"><tr bgcolor=\"#305701\"style=\"color:#ffffff;font-size:.8em;\"><td colspan=\"3\"><h1>&nbsp;" + (String)DISPLAY_NAME + " Setup</h1><h2>&nbsp;Status:</h2></td></tr><tr><td><br></td><td></td><td style=\"width:100%;\"></td></tr><tr><td>Connection Status:</td><td colspan=\"2\">";
  switch (WiFi.status()) {
    case WL_CONNECTED:
      html += "Connected to network";
      break;
    case WL_NO_SSID_AVAIL:
      html += "Network not found";
      break;
    case WL_CONNECT_FAILED:
      html += "Invalid password";
      break;
    case WL_IDLE_STATUS:
      html += "Changing state...";
      break;
    case WL_DISCONNECTED:
      html += "Station mode disabled";
      break;
#if ESP32
    default:
#else
    case -1:
#endif
      html += "Timeout";
      break;
  }

  html += "</td></tr><tr><td>Network name (SSID):</td><td colspan=\"2\">";
  html += getSSID();
  html += "</td></tr><tr><td><br></td></tr><tr><td>Signal strength:</td><td colspan=\"2\">";
  html += WiFi.RSSI();
  html += " dBm</td></tr>";
  //Commented out for users without batteries
  // html += "<tr><td><br></td></tr><tr><td>Battery voltage:</td><td colspan=\"2\">";
  // html += dtostrf(uBatt, 0, 3, buffer);
  // html += " V</td></tr>";
  html += "<tr><td>Static IP:</td><td colspan=\"2\">";
  html += settings.staticIP == true ? "True" : "False";
  html += "</td></tr><tr><td>" + (String)DISPLAY_NAME + " IP:</td><td colspan=\"2\">";
  html += WiFi.localIP().toString();
  html += "</td></tr><tr><td>Subnet mask: </td><td colspan=\"2\">";
  html += WiFi.subnetMask().toString();
  html += "</td></tr><tr><td>Gateway: </td><td colspan=\"2\">";
  html += WiFi.gatewayIP().toString();
  html += "</td></tr><tr><td><br></td></tr>";

  html += "<tr><td>ATEM switcher status:</td><td colspan=\"2\">";
  // if (atemSwitcher.hasInitialized())
  //     html += "Connected - Initialized";
  // else
  if (atemSwitcher.isRejected())
    html += "Connection rejected - No empty spot";
  else if (atemSwitcher.isConnected())
    html += "Connected";  // - Wating for initialization";
  else if (WiFi.status() == WL_CONNECTED)
    html += "Disconnected - No response from switcher";
  else
    html += "Disconnected - Waiting for WiFi";
  html += "</td></tr><tr><td>ATEM switcher IP:</td><td colspan=\"2\">";
  html += (String)settings.switcherIP[0] + '.' + settings.switcherIP[1] + '.' + settings.switcherIP[2] + '.' + settings.switcherIP[3];
  html += "</td></tr><tr><td><br></td></tr>";

