W9TIM/ATEM_tally_light_Relay_with_ESP8266/ATEM_tally_light/ATEM_tally_light.cpp
  html += "<tr bgcolor=\"#305701\"style=\"color:#ffffff;font-size:.8em;\"><td colspan=\"3\"><h2>&nbsp;Settings:</h2></td></tr><tr><td><br></td></tr><form action=\"/save\"method=\"post\"><tr><td>Tally Light name: </td><td><input type=\"text\"size=\"30\"maxlength=\"30\"name=\"tName\"value=\"";
#if ESP32
  html += WiFi.getHostname();
#else
  html += WiFi.hostname();
#endif
if (settings.tallyNo > 40) {
  settings.tallyNo = 0;
}
  html += "\"required/></td></tr><tr><td><br></td></tr><tr><td>Tally Light number: </td><td><input type=\"number\"size=\"5\"min=\"1\"max=\"41\"name=\"tNo\"value=\"";
  html += (settings.tallyNo + 1);
  html += "\"required/></td></tr><tr><td>Tally Light mode (LED 1):&nbsp;</td><td><select name=\"tModeLED1\"><option value=\"";
  html += (String)MODE_NORMAL + "\"";
  if (settings.tallyModeLED1 == MODE_NORMAL)
    html += "selected";
  html += ">Normal</option><option value=\"";
  html += (String)MODE_PREVIEW_STAY_ON + "\"";
  if (settings.tallyModeLED1 == MODE_PREVIEW_STAY_ON)
    html += "selected";
  html += ">Preview stay on</option><option value=\"";
  html += (String)MODE_PROGRAM_ONLY + "\"";
  if (settings.tallyModeLED1 == MODE_PROGRAM_ONLY)
    html += "selected";
  html += ">Program only</option><option value=\"";
  html += (String)MODE_ON_AIR + "\"";
  if (settings.tallyModeLED1 == MODE_ON_AIR)
    html += "selected";
  html += ">On Air Streaming</option><option value=\"";
  html += (String)MODE_ON_AIR_LIVE + "\"";
  if (settings.tallyModeLED1 == MODE_ON_AIR_LIVE)
    html += "selected";
  html += ">On Air Light</option></select></td></tr><tr><td>Tally Light mode (LED 2):</td><td><select name=\"tModeLED2\"><option value=\"";
  html += (String)MODE_NORMAL + "\"";
  if (settings.tallyModeLED2 == MODE_NORMAL)
    html += "selected";
  html += ">Normal</option><option value=\"";
  html += (String)MODE_PREVIEW_STAY_ON + "\"";
  if (settings.tallyModeLED2 == MODE_PREVIEW_STAY_ON)
    html += "selected";
  html += ">Preview stay on</option><option value=\"";
  html += (String)MODE_PROGRAM_ONLY + "\"";
  if (settings.tallyModeLED2 == MODE_PROGRAM_ONLY)
    html += "selected";
  html += ">Program only</option><option value=\"";
  html += (String)MODE_ON_AIR + "\"";
  if (settings.tallyModeLED2 == MODE_ON_AIR)
    html += "selected";
  html += ">On Air Streaming</option><option value=\"";
  html += (String)MODE_OFF + "\"";
  if (settings.tallyModeLED2 == MODE_OFF)
    html += "selected";
  html += ">LED Off</option></select></td></tr>";
   
  // Gather list of On Air Live Sources that one of which must be in Program mode while streaming to set relay shield on
  if (String(settings.liveSources).length() > 30) { //If undefined - set to default suggestion
    strncpy(settings.liveSources,"1,2,5",32);
  }
  html += "<tr><td><br></td></tr>"; // Blank line - Spacing
  html += "<tr><td> Tally On Air Live Sources (e.g. 1,2,5): </td><td><input type=\"text\" size=\"30\" maxlength=\"30\" name=\"tLiveSources\" value=\"";
  html += settings.liveSources;
  html += "\"required/></td></tr>"; 
  html += "<tr><td><br></td></tr>"; // Blank line - Spacing
  //

  // html += "<tr><td><br></td></tr>"; // Blank line - Spacing
  html += "<tr><td> Led brightness: </td><td><input type=\"number\"size=\"5\"min=\"0\"max=\"255\"name=\"ledBright\"value=\"";
  html += settings.ledBrightness;
  html += "\"required/></td></tr><tr><td><br></td></tr><tr><td>Amount of Neopixels:</td><td><input type=\"number\"size=\"5\"min=\"0\"max=\"1000\"name=\"neoPxAmount\"value=\"";
  html += settings.neopixelsAmount;
  html += "\"required/></td></tr><tr><td>Neopixel status LED: </td><td><select name=\"neoPxStatus\"><option value=\"";
  html += (String)NEOPIXEL_STATUS_FIRST + "\"";
  if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_FIRST)
    html += "selected";
  html += ">First LED</option><option value=\"";
  html += (String)NEOPIXEL_STATUS_LAST + "\"";
  if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_LAST)
    html += "selected";
  html += ">Last LED</option><option value=\"";
  html += (String)NEOPIXEL_STATUS_NONE + "\"";
  if (settings.neopixelStatusLEDOption == NEOPIXEL_STATUS_NONE)
    html += "selected";
  html += ">None</option></select></td></tr><tr><td> Neopixel brightness: </td><td><input type=\"number\"size=\"5\"min=\"0\"max=\"255\"name=\"neoPxBright\"value=\"";
  html += settings.neopixelBrightness;

  html += "\"required/></td></tr><tr><td><br></td></tr><tr><td>Network name(SSID): </td><td><input type =\"text\"size=\"30\"maxlength=\"30\"name=\"ssid\"value=\"";

  html += getSSID();

  html += "\"required/></td></tr><tr><td>Network password: </td><td><input type=\"password\"size=\"30\"maxlength=\"30\"name=\"pwd\"pattern=\"^$|.{8,32}\"value=\"";

  if (WiFi.isConnected())  //As a minimum security meassure, to only send the wifi password if it's currently connected to the given network.
    html += WiFi.psk();

  html += "\"/></td></tr><tr><td><br></td></tr><tr><td>Use static IP: </td><td><input type=\"hidden\"id=\"staticIPHidden\"name=\"staticIP\"value=\"false\"/><input id=\"staticIP\"type=\"checkbox\"name=\"staticIP\"value=\"true\"onchange=\"toggleStaticIPFields()\"";
  if (settings.staticIP)
    html += "checked";

  html += "/></td></tr><tr><td>" + (String)DISPLAY_NAME + " IP: </td><td><input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"tIP1\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyIP[0];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"tIP2\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyIP[1];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"tIP3\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyIP[2];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"tIP4\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyIP[3];

  html += "\"required/></td></tr><tr><td>Subnet mask: </td><td><input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"mask1\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallySubnetMask[0];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"mask2\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallySubnetMask[1];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"mask3\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallySubnetMask[2];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"mask4\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallySubnetMask[3];

  html += "\"required/></td></tr><tr><td>Gateway: </td><td><input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"gate1\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyGateway[0];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"gate2\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyGateway[1];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"gate3\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyGateway[2];
  html += "\"required/>. <input class=\"tIP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"gate4\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.tallyGateway[3];
  html += "\"required/></td></tr>";

  html += "<tr><td><br></td></tr><tr><td>ATEM switcher IP: </td><td><input class=\"IP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"aIP1\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.switcherIP[0];
  html += "\"required/>. <input class=\"IP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"aIP2\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.switcherIP[1];
  html += "\"required/>. <input class=\"IP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"aIP3\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.switcherIP[2];
  html += "\"required/>. <input class=\"IP\"type=\"text\"size=\"3\"maxlength=\"3\"name=\"aIP4\"pattern=\"\\d{0,3}\"value=\"";
  html += settings.switcherIP[3];
  html += "\"required/></tr>";

