W9TIM/ATEM_tally_light_Relay_with_ESP8266/ATEM_tally_light/ATEM_tally_light.cpp
  html += "<tr><td>Note: On Air Streaming and<br>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp On Air Light modes<br>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp require a direct connection<br>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp to the switcher<br>";

  html += "<tr><td></td></tr><tr><td/><td style=\"float: right;\"><input type=\"submit\"value=\"Save Changes\"/></td></tr></form><tr><td><br></td></tr><tr bgcolor=\"#b8ed77\"style=\"font-size: .8em;\"><td colspan=\"3\"><p>&nbsp;&copy; 2020-2022 <a href=\"https://aronhetlam.github.io/\">Aron N. Het Lam</a>, with Relay Shield and Live Source modifications by Tim Smith &nbsp;&copy; 2024</p><p>&nbsp;Based on ATEM libraries for Arduino by <a href=\"https://www.skaarhoj.com/\">SKAARHOJ</a></p></td></tr></table></body></html>";
  server.send(200, "text/html", html);
}

//Save new settings from client in EEPROM and restart the ESP8266 module
void handleSave() {
  if (server.method() != HTTP_POST) {
    server.send(405, "text/html", "<!DOCTYPE html><html><head><meta charset=\"ASCII\"><meta name=\"viewport\"content=\"width=device-width, initial-scale=1.0\"><title>Tally & On Air Light Setup</title></head><body style=\"font-family:Verdana;\"><table bgcolor=\"#305701\"border=\"0\"width=\"100%\"cellpadding=\"1\"style=\"color:#ffffff;font-size:.8em;\"><tr><td><h1>&nbsp;" + (String)DISPLAY_NAME + " setup</h1></td></tr></table><br>Request without posting settings not allowed</body></html>");
  } else {
    String ssid;
    String pwd;
    String sources;
    bool change = false;
    for (uint8_t i = 0; i < server.args(); i++) {
      change = true;
      String var = server.argName(i);
      String val = server.arg(i);

      //Serial.println(var+" / "+val); //Used to display elements of the settings structure for debugging
      if (var == "tName") {
        val.toCharArray(settings.tallyName, (uint8_t)32);
      } else if (var == "tLiveSources") {
        val.toCharArray(settings.liveSources, (uint8_t)32);
      } else if (var == "tModeLED1") {
        settings.tallyModeLED1 = val.toInt();
      } else if (var == "tModeLED2") {
        settings.tallyModeLED2 = val.toInt();
      } else if (var == "ledBright") {
        settings.ledBrightness = val.toInt();
      } else if (var == "neoPxAmount") {
        settings.neopixelsAmount = val.toInt();
      } else if (var == "neoPxStatus") {
        settings.neopixelStatusLEDOption = val.toInt();
      } else if (var == "neoPxBright") {
        settings.neopixelBrightness = val.toInt();
      } else if (var == "tNo") {
        settings.tallyNo = val.toInt() - 1;
      } else if (var == "ssid") {
        ssid = String(val);
      } else if (var == "pwd") {
        pwd = String(val);
      } else if (var == "staticIP") {
        settings.staticIP = (val == "true");
      } else if (var == "tIP1") {
        settings.tallyIP[0] = val.toInt();
      } else if (var == "tIP2") {
        settings.tallyIP[1] = val.toInt();
      } else if (var == "tIP3") {
        settings.tallyIP[2] = val.toInt();
      } else if (var == "tIP4") {
        settings.tallyIP[3] = val.toInt();
      } else if (var == "mask1") {
        settings.tallySubnetMask[0] = val.toInt();
      } else if (var == "mask2") {
        settings.tallySubnetMask[1] = val.toInt();
      } else if (var == "mask3") {
        settings.tallySubnetMask[2] = val.toInt();
      } else if (var == "mask4") {
        settings.tallySubnetMask[3] = val.toInt();
      } else if (var == "gate1") {
        settings.tallyGateway[0] = val.toInt();
      } else if (var == "gate2") {
        settings.tallyGateway[1] = val.toInt();
      } else if (var == "gate3") {
        settings.tallyGateway[2] = val.toInt();
      } else if (var == "gate4") {
        settings.tallyGateway[3] = val.toInt();
      } else if (var == "aIP1") {
        settings.switcherIP[0] = val.toInt();
      } else if (var == "aIP2") {
        settings.switcherIP[1] = val.toInt();
      } else if (var == "aIP3") {
        settings.switcherIP[2] = val.toInt();
      } else if (var == "aIP4") {
        settings.switcherIP[3] = val.toInt();
      }
    }

    if (change) {
      EEPROM.put(0, settings);
      EEPROM.commit();

      server.send(200, "text/html", (String) "<!DOCTYPE html><html><head><meta charset=\"ASCII\"><meta name=\"viewport\"content=\"width=device-width, initial-scale=1.0\"><title>Tally & On Air Light Setup</title></head><body><table bgcolor=\"##305701\"border=\"0\"width=\"100%\"cellpadding=\"1\"style=\"font-family:Verdana;color:#ffffff;font-size:.8em;\"><tr><td><h1>&nbsp;" + (String)DISPLAY_NAME + " Setup</h1></td></tr></table><br>Settings saved successfully.</body></html>");

      // Delay to let data be saved, and the response to be sent properly to the client
      server.close();  // Close server to flush and ensure the response gets to the client
      delay(100);

      // Change into STA mode to disable softAP
      WiFi.mode(WIFI_STA);
      delay(100);  // Give it time to switch over to STA mode (this is important on the ESP32 at least)

      if (ssid && pwd) {
        WiFi.persistent(true);  // Needed by ESP8266
        // Pass in 'false' as 5th (connect) argument so we don't waste time trying to connect, just save the new SSID/PSK
        // 3rd argument is channel - '0' is default. 4th argument is BSSID - 'NULL' is default.
        WiFi.begin(ssid.c_str(), pwd.c_str(), 0, NULL, false);
      }

      //Delay to apply settings before restart
      delay(100);
      ESP.restart();
    }
  }
}

//Send 404 to client in case of invalid webpage being requested.
void handleNotFound() {
  server.send(404, "text/html", "<!DOCTYPE html><html><head><meta charset=\"ASCII\"><meta name=\"viewport\"content=\"width=device-width, initial-scale=1.0\"><title>" + (String)DISPLAY_NAME + " Setup</title></head><body style=\"font-family:Verdana;\"><table bgcolor=\"#305701\"border=\"0\"width=\"100%\"cellpadding=\"1\"style=\"color:#ffffff;font-size:.8em;\"><tr><td><h1>&nbsp Tally & On Air Light Setup</h1></td></tr></table><br>404 - Page not found</body></html>");
}

String getSSID() {
#if ESP32
  wifi_config_t conf;
  esp_wifi_get_config(WIFI_IF_STA, &conf);
  return String(reinterpret_cast<const char *>(conf.sta.ssid));
#else
  return WiFi.SSID();
#endif
}

//Commented out for users without batteries - Also timer is not done properly
//Main loop for things that should work every second
// void batteryLoop() {
//     if (secLoop >= 400) {
//         //Get and calculate battery current
//         int raw = analogRead(A0);
//         uBatt = (double)raw / 1023 * 4.2;

//         //Set back status LED after one second to working LED_BLUE if it was changed by anything
//         if (lowLedOn) {
//             setStatusLED(LED_ORANGE);
//             lowLedOn = false;
//         }

//         //Blink every 5 seconds for one second if battery current is under 3.6V
//         if (lowLedCount >= 5 && uBatt <= 3.600) {
//             setStatusLED(LED_YELLOW);
//             lowLedOn = true;
//             lowLedCount = 0;
//         }
//         lowLedCount++;

//        //Turn stripes of and put ESP to deepsleep if battery is too low
//        if(uBatt <= 3.499) {
//            setSTRIP(LED_OFF);
//            setStatusLED(LED_OFF);
//            ESP.deepSleep(0, WAKE_NO_RFCAL);
//        }

//         secLoop = 0;
//     }
//     secLoop++;
// }
